Repository: devsoftwareapp/crdvapp
Catalog: assets/l10n/intl_*.arb
Languages: ckb, hi, vi

source: Cancel
ckb: هەڵوەشاندنەوە
hi: रद्द करें
vi: Hủy

source: Delete
ckb: سڕینەوە
hi: हटाएं
vi: Xóa

source: Rename
ckb: ناوگۆڕین
hi: नाम बदलें
vi: Đổi tên

source: Edit
ckb: دەستکاری
hi: संपादित करें
vi: Chỉnh sửa

source: Print
ckb: چاپکردن
hi: प्रिंट करें
vi: In

source: Share
ckb: هاوبەشی
hi: साझा करें
vi: Chia sẻ

source: Move
ckb: گواستنەوە
hi: स्थानांतरित करें
vi: Di chuyển

source: ALLOW
ckb: ڕێگەدان
hi: अनुमति दें
vi: Cho phép

source: Create
ckb: دروستکردن
hi: बनाएं
vi: Tạo

source: All Files
ckb: هەموو پەڕگەکان
hi: सभी फ़ाइलें
vi: Tất cả tệp

source: Recent
ckb: دوایین
hi: हाल ही के
vi: Gần đây

source: Favorites
ckb: دڵخوازەکان
hi: पसंदीदा
vi: Yêu thích

source: Tools
ckb: ئامرازەکان
hi: उपकरण
vi: Công cụ

source: Search files...
ckb: گەڕان لە پەڕگەکان...
hi: फ़ाइलें खोजें...
vi: Tìm kiếm tệp...

source: Sort by Name
ckb: پۆلێنکردن بە ناو
hi: नाम से क्रमबद्ध करें
vi: Sắp xếp theo tên

source: Sort by Size
ckb: پۆلێنکردن بە قەبارە
hi: आकार से क्रमबद्ध करें
vi: Sắp xếp theo kích thước

source: Sort by Date
ckb: پۆلێنکردن بە بەروار
hi: तारीख से क्रमबद्ध करें
vi: Sắp xếp theo ngày

source: Language
ckb: زمان
hi: भाषा
vi: Ngôn ngữ

source: About
ckb: دەربارە
hi: के बारे में
vi: Giới thiệu

source: Import File
ckb: هێنانی پەڕگە
hi: फ़ाइल आयात करें
vi: Nhập tệp

source: Dark/Light Mode
ckb: دۆخی تاریک / ڕووناک
hi: डार्क/लाइट मोड
vi: Chế độ Tối/Sáng

# all_work_local
source: All work is done locally on your device. No data is shared or uploaded.
ckb: هەموو کارەکان بە شێوەی ناوخۆیی لەسەر ئامێرەکەت ئەنجام دەدرێت. هیچ زانیاریەک نەنێردرێت.
hi: सारा कार्य आपके डिवाइस पर स्थानीय रूप से किया जाता है। कोई डेटा साझा या अपलोड नहीं किया जाता।
vi: Tất cả công việc được thực hiện cục bộ trên thiết bị của bạn. Không có dữ liệu nào được chia sẻ hoặc tải lên.

# developed_by
source: Developed by Devsoftware
ckb: پەرەسەند کراوە لەلایەن Devsoftware
hi: डेवसॉफ्टवेयर द्वारा विकसित
vi: Phát triển bởi Devsoftware

source: Select Language
ckb: زمانێک هەلبژێرە
hi: भाषा चुनें
vi: Chọn ngôn ngữ

source: Search language...
ckb: گەڕان بۆ زمان...
hi: भाषा खोजें...
vi: Tìm kiếm ngôn ngữ...

# no_language_found
source: No language found for your search.
ckb: هیچ زمانێک نەدۆزرایەوە.
hi: आपकी खोज के लिए कोई भाषा नहीं मिली।
vi: Không tìm thấy ngôn ngữ phù hợp.

source: File imported successfully.
ckb: پەڕگە بەسەرکەوتووی هاتە ناوەوە.
hi: फ़ाइल सफलतापूर्वक आयात की गई।
vi: Tệp đã được nhập thành công.

source: All Files (Root)
ckb: هەموو پەڕگەکان (ڕەگ)
hi: सभी फ़ाइलें (रूट)
vi: Tất cả tệp (Thư mục gốc)

# move_to_main_directory
source: Main application storage directory
ckb: بوخچەی سەرەکی پاشەکەوتکردن
hi: मुख्य ऐप निर्देशिका
vi: Thư mục lưu trữ chính của ứng dụng

source: Rename File
ckb: ناوی پەڕگە بگۆڕە
hi: फ़ाइल का नाम बदलें
vi: Đổi tên tệp

source: New file name
ckb: ناوی نوێی پەڕگە
hi: नई फ़ाइल का नाम
vi: Tên tệp mới

source: Rename Folder
ckb: ناوی بوخچە بگۆڕە
hi: फ़ोल्डर का नाम बदलें
vi: Đổi tên thư mục

source: New folder name
ckb: ناوی نوێی بوخچە
hi: नए फ़ोल्डर का नाम
vi: Tên thư mục mới

source: Move File
ckb: پەڕگە بگوازەوە
hi: फ़ाइल स्थानांतरित करें
vi: Di chuyển tệp

source: Create Folder
ckb: بوخچەیەک دروست بکە
hi: फ़ोल्डर बनाएं
vi: Tạo thư mục

source: Folder Name
ckb: ناوی بوخچە
hi: फ़ोल्डर का नाम
vi: Tên thư mục

# folder_created
source: Folder created: "{name}"
ckb: بوخچە دروست کرا: "{name}"
hi: फ़ोल्डर बनाया गया: "{name}"
vi: Đã tạo thư mục: "{name}"

source: Delete File
ckb: سڕینەوەی پەڕگە
hi: फ़ाइल हटाएं
vi: Xóa tệp

source: Delete Folder
ckb: سڕینەوەی بوخچە
hi: फ़ोल्डर हटाएं
vi: Xóa thư mục

# delete_files
source: Delete Selected Files
ckb: سڕینەوەی پەڕگە دیاریکراوەکان
hi: चयनित फ़ाइलें हटाएं
vi: Xóa các tệp đã chọn

# are_you_sure_delete
source: Are you sure you want to delete
ckb: دڵنیایت دەتەوێت بیسریتەوە
hi: क्या आप वाकई हटाना चाहते हैं
vi: Bạn có chắc muốn xóa

# and_all_contents
source: and all its contents
ckb: و هەموو ناوەڕۆکی ئەوە
hi: और इसकी सभी सामग्री?
vi: và toàn bộ nội dung của nó không?

source: File deleted.
ckb: پەڕگە سڕایەوە.
hi: फ़ाइल हटाई गई।
vi: Đã xóa tệp.

source: Folder deleted.
ckb: بوخچە سڕایەوە.
hi: फ़ोल्डर हटाया गया।
vi: Đã xóa thư mục.

# files_deleted_count
source: {count, plural, one{1 file deleted} other{{count} files deleted}}
ckb: {count, plural, one{پەڕگەیەک سڕایەوە} other{{count} پەڕگە سڕرانەوە}}
hi: {count, plural, one{1 फ़ाइल हटाई गई} other{{count} फ़ाइलें हटाई गईं}}
vi: {count, plural, one{1 tệp đã bị xóa} other{{count} tệp đã bị xóa}}

# items
source: {count, plural, one{1 item} other{{count} items}}
ckb: {count, plural, one{یەک شت} other{{count} شت}}
hi: {count, plural, one{1 आइटम} other{{count} आइटम}}
vi: {count, plural, one{1 mục} other{{count} mục}}

source: Change Folder Color
ckb: گۆڕینی ڕەنگی بوخچە
hi: फ़ोल्डर का रंग बदलें
vi: Thay đổi màu thư mục

source: Change Color
ckb: گۆڕینی ڕەنگ
hi: रंग बदलें
vi: Thay đổi màu

# no_files_found
source: No files found for "{query}"
ckb: هیچ پەڕگەیەک نەدۆزرایەوە بۆ "{query}"
hi: "{query}" के लिए कोई फ़ाइल नहीं मिली
vi: Không tìm thấy tệp cho "{query}"

# permission_required
source: Storage Permission Required
ckb: پێویستە بە مۆڵەت
hi: स्टोरेज अनुमति आवश्यक है
vi: Yêu cầu quyền truy cập bộ nhớ

# permission_description
source: To save updated PDFs on your device (e.g., in the Documents folder), we need 'All Files Access' permission.
ckb: بۆ پاشەکەوتکردنی PDF گۆڕدراوەکانت لەسەر ئامێرەکەت (بۆ نموونە لە بوخچەی Documents)، پێویستە بە مۆڵەتی 'دەستگەیشتنی هەموو پەڕگەکان'.
hi: अपडेटेड PDF को आपके डिवाइस में (जैसे डॉक्युमेंट्स फ़ोल्डर में) सहेजने के लिए हमें 'सभी फ़ाइलों की पहुँच' की अनुमति चाहिए।
vi: Để lưu các tệp PDF đã cập nhật trên thiết bị của bạn (ví dụ: trong thư mục Tài liệu), chúng tôi cần quyền 'Truy cập tất cả tệp'.

source: saved successfully
ckb: بەسەرکەوتووی پاشەکەوت کرا
hi: सफलतापूर्वक सहेजा गया
vi: đã lưu thành công

source: Location
ckb: شوێن
hi: स्थान
vi: Vị trí

source: PDF save error
ckb: هەڵەی پاشەکەوتکردنی PDF
hi: PDF सहेजने में त्रुटि हुई
vi: Lỗi lưu PDF

source: Merge PDF
ckb: تێکەڵکردنی PDF
hi: PDF मर्ज करें
vi: Gộp PDF

# merge_pdf_description
source: Merge multiple PDFs into one
ckb: چند PDF یەکبکەرەوە بۆ یەک پەڕگە
hi: कई PDF फ़ाइलों को एक में मिलाएं
vi: Gộp nhiều tệp PDF thành một

source: Edit Pages
ckb: دەستکاری پەڕەکان
hi: पेज संपादित करें
vi: Chỉnh sửa trang

# edit_pages_description
source: Reorder or edit PDF pages
ckb: پێڕستکردن یان دەستکاری پەڕەکان
hi: PDF पेजों को पुनः व्यवस्थित या संपादित करें
vi: Sắp xếp lại hoặc chỉnh sửa các trang PDF

source: Extract Text
ckb: دەرخستنی دەق
hi: टेक्स्ट निकालें
vi: Trích xuất văn bản

# extract_text_description
source: Extract text from PDF or image using OCR
ckb: دەق دەرخە لە PDF یان وێنە بە بەکارهێنانی OCR
hi: OCR के माध्यम से PDF या इमेज से टेक्स्ट निकालें
vi: Trích xuất văn bản từ PDF hoặc hình ảnh bằng OCR

source: Split PDF
ckb: پارچەکردنی PDF
hi: PDF विभाजित करें
vi: Tách PDF

# split_pdf_description
source: Split PDF into separate pages
ckb: PDF بپارێزە بۆ پەڕە جیاوازەکان
hi: PDF को अलग-अलग पेजों में विभाजित करें
vi: Tách PDF thành các trang riêng lẻ

source: Compress PDF
ckb: کەمکردنەوەی قەبارەی PDF
hi: PDF संपीड़ित करें
vi: Nén PDF

# compress_pdf_description
source: Reduce file size
ckb: کەمکردنەوەی قەبارەی پەڕگە
hi: फ़ाइल आकार कम करें
vi: Giảm kích thước tệp

source: PDF to Image
ckb: گۆڕینی PDF بۆ وێنە
hi: PDF को इमेज में बदलें
vi: PDF sang Hình ảnh

# pdf_to_image_description
source: Convert PDF to images
ckb: گۆڕینی پەڕگەی PDF بۆ وێنەکان
hi: PDF को इमेज में कनवर्ट करें
vi: Chuyển đổi PDF thành hình ảnh

# permission_required_tools
source: Permission Required
ckb: پێویستە بە مۆڵەت
hi: अनुमति आवश्यक है
vi: Yêu cầu quyền

# permission_description_tools
source: We need "All files access" permission to save your PDF and text files to the Documents/pdfreadermanager folder.
ckb: پێویستە بە مۆڵەتی "دەستگەیشتنی هەموو پەڕگەکان" بۆ پاشەکەوتکردنی پەڕگەکانت لە بوخچەی Documents/pdfreadermanager.
hi: 'सभी फ़ाइलों की पहुँच' की अनुमति की आवश्यकता है ताकि आपकी PDF और टेक्स्ट फ़ाइलें Documents/pdfreadermanager में सहेजी जा सकें।
vi: Chúng tôi cần quyền 'Truy cập tất cả tệp' để lưu các tệp PDF và văn bản của bạn vào thư mục Documents/pdfreadermanager.

# file_saved_success
source: ✅ {fileName} saved
ckb: ✅ {fileName} پاشەکەوت کرا
hi: ✅ {fileName} सहेजा गया
vi: ✅ Đã lưu {fileName}

# file_save_error
source: ❌ File could not be saved: {error}
ckb: ❌ نەتوانرا پەڕگە پاشەکەوت بکرێت: {error}
hi: ❌ फ़ाइल सहेजने में विफल: {error}
vi: ❌ Không thể lưu tệp: {error}

# image_save_error
source: ❌ Image could not be saved
ckb: ❌ نەتوانرا وێنە پاشەکەوت بکرێت
hi: ❌ इमेज सहेजने में विफल
vi: ❌ Không thể lưu hình ảnh

# file_save_error_short
source: File could not be saved
ckb: نەتوانرا پەڕگە پاشەکەوت بکرێت
hi: फ़ाइल सहेजने में विफल
vi: Không thể lưu tệp
